Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/state-and-lifecycle_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: state-and-lifecycle title: State and Lifecycle permalink: docs/state-and-lifecycle.html redirect_from:
ja: --- id: state-and-lifecycle title: state とライフサイクル permalink: docs/state-and-lifecycle.html redirect_from:

source: This page introduces the concept of state and lifecycle in a React component.
ja: このページでは React コンポーネントにおける state とライフサイクルについての導入を行います。

source: You can find a [detailed component API reference here](/docs/react-component.html).
ja: [詳細なコンポーネントの API リファレンスはこちら](/docs/react-component.html)にあります。

source: Consider the ticking clock example from [one of the previous sections](/docs/rendering-elements.html#updating-the-rendered-element).
ja: [以前の章のひとつ](/docs/rendering-elements.html#updating-the-rendered-element)にあった秒刻みの時計の例を考えてみましょう。

source: In [Rendering Elements](/docs/rendering-elements.html#rendering-an-element-into-the-dom), we have only learned one way to update the UI.
ja: [要素のレンダー](/docs/rendering-elements.html#rendering-an-element-into-the-dom)の章にて、UI を更新するための方法をひとつだけ学びました。

source: We call `ReactDOM.render()` to change the rendered output:
ja: それはレンダーされた出力を更新するために `ReactDOM.render()` を呼び出す、というものでした。

source: In this section, we will learn how to make the `Clock` component truly reusable and encapsulated.
ja: このセクションでは、この `Clock` コンポーネントを真に再利用可能かつカプセル化されたものにする方法を学びます。

source: It will set up its own timer and update itself every second.
ja: コンポーネントが自身でタイマーをセットアップし、自身を毎秒更新するようにします。

source: We can start by encapsulating how the clock looks:
ja: 時計の見た目をカプセル化するところから始めてみましょう：

source: However, it misses a crucial requirement: the fact that the `Clock` sets up a timer and updates the UI every second should be an implementation detail of the `Clock`.
ja: しかし上記のコードは重要な要件を満たしていません：`Clock` がタイマーを設定して UI を毎秒ごとに更新するという処理は、`Clock` の内部実装の詳細 (implementation detail) であるべきだということです。

source: Ideally we want to write this once and have the `Clock` update itself:
ja: 理想的には以下のコードを一度だけ記述して、`Clock` に自身を更新させたいのです：

source: To implement this, we need to add "state" to the `Clock` component.
ja: これを実装するには、`Clock` コンポーネントに "ステート (state)" を追加する必要があります。

source: State is similar to props, but it is private and fully controlled by the component.
ja: state は props に似ていますが、コンポーネントによって完全に管理されるプライベートなものです。

source: ## Converting a Function to a Class {#converting-a-function-to-a-class}
ja: ## 関数をクラスに変換する {#converting-a-function-to-a-class}

source: You can convert a function component like `Clock` to a class in five steps:
ja: 以下の 5 ステップで、`Clock` のような関数コンポーネントをクラスに変換することができます。

source: Create an [ES6 class](https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Classes), with the same name, that extends `React.Component`.
ja: `React.Component` を継承する同名の [ES6 クラス](https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Classes)を作成する。

source: Add a single empty method to it called `render()`.
ja: `render()` と呼ばれる空のメソッドを 1 つ追加する。

source: Move the body of the function into the `render()` method.
ja: 関数の中身を `render()` メソッドに移動する。

source: Replace `props` with `this.props` in the `render()` body.
ja: `render()` 内の `props` を `this.props` に書き換える。

source: Delete the remaining empty function declaration.
ja: 空になった関数の宣言部分を削除する。

source: `Clock` is now defined as a class rather than a function.
ja: これで、`Clock` は関数ではなくクラスとして定義されるようになりました。

source: The `render` method will be called each time an update happens, but as long as we render `<Clock />` into the same DOM node, only a single instance of the `Clock` class will be used.
ja: `render` メソッドは更新が発生した際に毎回呼ばれますが、同一の DOM ノード内で `<Clock />` をレンダーしている限り、`Clock` クラスのインスタンスは 1 つだけ使われます。

source: This lets us use additional features such as local state and lifecycle methods.
ja: このことにより、ローカル state やライフサイクルメソッドといった追加の機能が利用できるようになります。

source: ## Adding Local State to a Class {#adding-local-state-to-a-class}
ja: ## クラスにローカルな state を追加する {#adding-local-state-to-a-class}

source: We will move the `date` from props to state in three steps:
ja: 以下の 3 ステップで `date` を props から state に移します：

source: 1) Replace `this.props.date` with `this.state.date` in the `render()` method:
ja: 1) `render()` メソッド内の `this.props.date` を `this.state.date` に書き換える：

source: 2) Add a [class constructor](https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Classes#Constructor) that assigns the initial `this.state`:
ja: 2) `this.state` の初期状態を設定する[クラスコンストラクタ](https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Classes#Constructor)を追加する：

source: Note how we pass `props` to the base constructor:
ja: 親クラスのコンストラクタへの `props` の渡し方に注目してください：

source: Class components should always call the base constructor with `props`. 3)
ja: クラスのコンポーネントは常に `props` を引数として親クラスのコンストラクタを呼び出す必要があります。

source: Remove the `date` prop from the `<Clock />` element:
ja: 3) `<Clock />` 要素から `date` プロパティを削除する：

source: We will later add the timer code back to the component itself.
ja: タイマーのコードはコンポーネント自身に後で追加しなおします。

source: The result looks like this:
ja: 結果は以下のようになります：

source: Next, we'll make the `Clock` set up its own timer and update itself every second.
ja: 次に、`Clock` が自分でタイマーを設定し、毎秒ごとに自分を更新するようにします。

source: ## Adding Lifecycle Methods to a Class {#adding-lifecycle-methods-to-a-class}
ja: ## クラスにライフサイクルメソッドを追加する {#adding-lifecycle-methods-to-a-class}

source: In applications with many components, it's very important to free up resources taken by the components when they are destroyed.
ja: 多くのコンポーネントを有するアプリケーションでは、コンポーネントが破棄された場合にそのコンポーネントが占有していたリソースを解放することがとても重要です。

source: We want to [set up a timer](https://developer.mozilla.org/en-US/docs/Web/API/WindowTimers/setInterval) whenever the `Clock` is rendered to the DOM for the first time.
ja: [タイマーを設定](https://developer.mozilla.org/en-US/docs/Web/API/WindowTimers/setInterval)したいのは、最初に `Clock` が DOM として描画されるときです。

source: This is called "mounting" in React.
ja: このことを React では "マウント (mounting)" と呼びます。

source: We also want to [clear that timer](https://developer.mozilla.org/en-US/docs/Web/API/WindowTimers/clearInterval) whenever the DOM produced by the `Clock` is removed.
ja: また[タイマーをクリア](https://developer.mozilla.org/en-US/docs/Web/API/WindowTimers/clearInterval)したいのは、`Clock` が生成した DOM が削除されるときです。

source: This is called "unmounting" in React.
ja: このことを React では "アンマウント (unmounting)" と呼びます。

source: We can declare special methods on the component class to run some code when a component mounts and unmounts:
ja: コンポーネントクラスで特別なメソッドを宣言することで、コンポーネントがマウントしたりアンマウントしたりした際にコードを実行することができます：

source: These methods are called "lifecycle methods".
ja: これらのメソッドは "ライフサイクルメソッド (lifecycle method)" と呼ばれます。

source: The `componentDidMount()` method runs after the component output has been rendered to the DOM. This is a good place to set up a timer:
ja: `componentDidMount()` メソッドは、出力が DOM にレンダーされた後に実行されます。ここがタイマーをセットアップするのによい場所です：

source: Note how we save the timer ID right on `this` (`this.timerID`).
ja: タイマー ID を直接 `this` 上に（`this.timerID` として）格納したことに注目してください。

source: While `this.props` is set up by React itself and `this.state` has a special meaning, you are free to add additional fields to the class manually if you need to store something that doesn’t participate in the data flow (like a timer ID).
ja: `this.props` は React 自体によって設定され、また `this.state` は特別な意味を持っていますが、何かデータフローに影響しないデータ（タイマー ID のようなもの）を保存したい場合に、追加のフィールドを手動でクラスに追加することは自由です。

source: We will tear down the timer in the `componentWillUnmount()` lifecycle method:
ja: タイマーの後片付けは `componentWillUnmount()` というライフサイクルメソッドで行います：

source: Finally, we will implement a method called `tick()` that the `Clock` component will run every second.
ja: 最後に、`Clock` コンポーネントが毎秒ごとに実行する `tick()` メソッドを実装します。

source: It will use `this.setState()` to schedule updates to the component local state:
ja: コンポーネントのローカル state の更新をスケジュールするために `this.setState()` を使用します：

source: Now the clock ticks every second.
ja: これで、この時計は毎秒ごとに時間を刻みます。

source: Let's quickly recap what's going on and the order in which the methods are called:
ja: 何が起こったのかをメソッドが呼び出される順序にそって簡単に振り返ってみましょう：

source: 1) When `<Clock />` is passed to `ReactDOM.render()`, React calls the constructor of the `Clock` component.
ja: 1) `<Clock />` が `ReactDOM.render()` に渡されると、React は `Clock` コンポーネントのコンストラクタを呼び出します。

source: Since `Clock` needs to display the current time, it initializes `this.state` with an object including the current time.
ja: `Clock` は現在時刻を表示する必要があるので、現在時刻を含んだオブジェクトで `this.state` を初期化します。

source: We will later update this state.
ja: あとでこの state を更新していきます。

source: 2) React then calls the `Clock` component's `render()` method.
ja: 2) 次に React は `Clock` コンポーネントの `render()` メソッドを呼び出します。

source: This is how React learns what should be displayed on the screen.
ja: これにより React は画面に何を表示すべきか知ります。

source: React then updates the DOM to match the `Clock`'s render output.
ja: そののちに、React は DOM を `Clock` のレンダー出力と一致するように更新します。

source: 3) When the `Clock` output is inserted in the DOM, React calls the `componentDidMount()` lifecycle method.
ja: 3) `Clock` の出力が DOM に挿入されると、React は `componentDidMount()` ライフサイクルメソッドを呼び出します。

source: Inside it, the `Clock` component asks the browser to set up a timer to call the component's `tick()` method once a second. 4)
ja: その中で、`Clock` コンポーネントは毎秒ごとにコンポーネントの `tick()` メソッドを呼び出すためにタイマーを設定するようブラウザに要求します。

source: Every second the browser calls the `tick()` method.
ja: 4) ブラウザは、毎秒ごとに `tick()` メソッドを呼び出します。

source: Inside it, the `Clock` component schedules a UI update by calling `setState()` with an object containing the current time.
ja: その中で `Clock` コンポーネントは、現在時刻を含んだオブジェクトを引数として `setState()` を呼び出すことで、UI の更新をスケジュールします。

source: Thanks to the `setState()` call, React knows the state has changed, and calls the `render()` method again to learn what should be on the screen.
ja: `setState()` が呼び出されたおかげで、React は state が変わったということが分かるので、`render()` メソッドを再度呼び出して、画面上に何を表示すべきかを知ります。

source: This time, `this.state.date` in the `render()` method will be different, and so the render output will include the updated time.
ja: 今回は、`render()` メソッド内の `this.state.date` が異なっているので、レンダーされる出力には新しく更新された時間が含まれています。

source: React updates the DOM accordingly.
ja: それに従って React は DOM を更新します。

source: 5) If the `Clock` component is ever removed from the DOM, React calls the `componentWillUnmount()` lifecycle method so the timer is stopped.
ja: 5) この後に `Clock` コンポーネントが DOM から削除されることがあれば、React は `componentWillUnmount()` ライフサイクルメソッドを呼び出し、これによりタイマーが停止します。

source: ## Using State Correctly {#using-state-correctly}
ja: ## state を正しく使用する {#using-state-correctly}

source: There are three things you should know about `setState()`.
ja: `setState()` について知っておくべきことが 3 つあります。

source: ### Do Not Modify State Directly {#do-not-modify-state-directly}
ja: ### state を直接変更しないこと {#do-not-modify-state-directly}

source: For example, this will not re-render a component:
ja: 例えば、以下のコードではコンポーネントは再レンダーされません：

source: Instead, use `setState()`:
ja: 代わりに `setState()` を使用してください：

source: The only place where you can assign `this.state` is the constructor.
ja: `this.state` に直接代入してよい唯一の場所はコンストラクタです。

source: ### State Updates May Be Asynchronous {#state-updates-may-be-asynchronous}
ja: ### state の更新は非同期に行われる可能性がある {#state-updates-may-be-asynchronous}

source: React may batch multiple `setState()` calls into a single update for performance.
ja: React はパフォーマンスのために、複数の `setState()` 呼び出しを 1 度の更新にまとめて処理することがあります。

source: Because `this.props` and `this.state` may be updated asynchronously, you should not rely on their values for calculating the next state.
ja: `this.props` と `this.state` は非同期に更新されるため、次の state を求める際に、それらの値に依存するべきではありません。

source: For example, this code may fail to update the counter:
ja: 例えば、以下のコードはカウンターの更新に失敗することがあります：

source: To fix it, use a second form of `setState()` that accepts a function rather than an object.
ja: これを修正するために、オブジェクトではなく関数を受け取る `setState()` の 2 つ目の形を使用します。

source: That function will receive the previous state as the first argument, and the props at the time the update is applied as the second argument:
ja: その関数は前の state を最初の引数として受け取り、更新が適用される時点での props を第 2 引数として受け取ります：

source: We used an [arrow function](https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Functions/Arrow_functions) above, but it also works with regular functions:
ja: 上記のコードでは[アロー関数](https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Functions/Arrow_functions)を使いましたが、通常の関数でも動作します：

source: ### State Updates are Merged {#state-updates-are-merged}
ja: ### state の更新はマージされる {#state-updates-are-merged}

source: When you call `setState()`, React merges the object you provide into the current state.
ja: `setState()` を呼び出した場合、React は与えられたオブジェクトを現在の state にマージします。

source: For example, your state may contain several independent variables:
ja: 例えば、あなたの state はいくつかの独立した変数を含んでいるかもしれません：

source: Then you can update them independently with separate `setState()` calls:
ja: その場合、別々の `setState()` 呼び出しで、それらの変数を独立して更新することができます：

source: The merging is shallow, so `this.setState({comments})` leaves `this.state.posts` intact, but completely replaces `this.state.comments`.
ja: マージは浅く (shallow) 行われるので、`this.setState({comments})` は `this.state.posts` をそのまま残しますが、`this.state.comments` を完全に置き換えます。

source: ## The Data Flows Down {#the-data-flows-down}
ja: ## データは下方向に伝わる {#the-data-flows-down}

source: Neither parent nor child components can know if a certain component is stateful or stateless, and they shouldn't care whether it is defined as a function or a class.
ja: 親コンポーネントであれ子コンポーネントであれ、特定の他のコンポーネントがステートフルかステートレスかを知ることはできませんし、特定のコンポーネントの定義が関数型かクラス型かを気にするべきではありません。

source: This is why state is often called local or encapsulated.
ja: これが、state はローカルのものである、ないしはカプセル化されている、と言われる理由です。

source: It is not accessible to any component other than the one that owns and sets it.
ja: state を所有してセットするコンポーネント自身以外からはその state にアクセスすることができません。

source: A component may choose to pass its state down as props to its child components:
ja: コンポーネントはその子コンポーネントに props として自身の state を渡してもかまいません。

source: The `FormattedDate` component would receive the `date` in its props and wouldn't know whether it came from the `Clock`'s state, from the `Clock`'s props, or was typed by hand:
ja: `FormattedDate` コンポーネントは props 経由で `date` を受け取りますが、それが `Clock` の state から来たのか、`Clock` の props から来たのか、もしくは手書きされたものなのかは分かりません：

source: This is commonly called a "top-down" or "unidirectional" data flow.
ja: このデータフローは一般的には "トップダウン" もしくは "単一方向" データフローと呼ばれます。

source: Any state is always owned by some specific component, and any data or UI derived from that state can only affect components "below" them in the tree.
ja: いかなる state も必ず特定のコンポーネントが所有し、state から生ずる全てのデータまたは UI は、ツリーでそれらの "下" にいるコンポーネントにのみ影響します。

source: If you imagine a component tree as a waterfall of props, each component's state is like an additional water source that joins it at an arbitrary point but also flows down.
ja: コンポーネントツリーとは props が流れ落ちる滝なのだと想像すると、各コンポーネントの state とは任意の場所で合流してくる追加の水源であり、それらもまた下に流れ落ちていくものなのです。

source: To show that all components are truly isolated, we can create an `App` component that renders three `<Clock>`s:
ja: 全てのコンポーネントが本当に独立していることを示すのに、3 つの `<Clock>` をレンダーする `App` コンポーネントを作成します：

source: Each `Clock` sets up its own timer and updates independently.
ja: 各 `Clock` は独立してタイマーをセットし、独立して更新されます。

source: In React apps, whether a component is stateful or stateless is considered an implementation detail of the component that may change over time.
ja: React アプリケーションでは、コンポーネントがステートフルかステートレスかは、コンポーネントにおける内部実装の詳細 (implementation detail) とみなされ、それは時間と共に変化しうるものです。

source: You can use stateless components inside stateful components, and vice versa.
ja: ステートレスなコンポーネントをステートフルなコンポーネントの中で使うことが可能であり、その逆も同様です。
